rtkconnectivity/zephyr/drivers/i2s/i2s_rtl8752h.c
/*
 * Copyright(c) 2024, Realtek Semiconductor Corporation.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/**
 * @brief Driver for I2S port on RTL8752H family processor.
 * @note  Please validate for newly added series.
 */

#include <errno.h>
#include <string.h>
#include <zephyr/sys/__assert.h>
#include <zephyr/kernel.h>
#include <zephyr/device.h>
#include <zephyr/init.h>
#include <zephyr/drivers/dma.h>
#include <zephyr/drivers/i2s.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/rtl8752h_clock_control.h>
#include <soc.h>

#include <zephyr/drivers/dma/dma_rtl8752h.h>
#include <zephyr/drivers/dma.h>
#include <rtl876x_gdma.h>
#include <rtl876x_i2s.h>
#include <rtl876x_pinmux.h>

#include <zephyr/logging/log.h>
#include <zephyr/irq.h>

#include "trace.h"

LOG_MODULE_REGISTER(i2s_rtl8752h, CONFIG_I2S_LOG_LEVEL);

#define DT_DRV_COMPAT realtek_rtl8752h_i2s

#define I2S_SRC_CLK 40000000

#if !defined(CONFIG_I2S_RTL8752H_RX) && !defined(CONFIG_I2S_RTL8752H_TX)
BUILD_ASSERT(false, "I2S RX or TX should be enabled!");
#endif

/*
 * I2S driver uses multi block feature of DMA, and relies on DMA driver
 * managing circular list of DMA blocks.
 *
 * This indicates the Tx/Rx stream.
 *
 * in_queue and out_queue are used as follows
 *   transmit stream:
 *   application provided buffer is queued to in_queue until loaded to DMA.
 *   when DMA channel is idle, buffer is retrieved from in_queue and loaded
 *   to DMA and queued to out_queue. when DMA completes, buffer is retrieved
 *   from out_queue and freed.
 *
 *   receive stream:
 *   driver allocates buffer from slab and loads DMA buffer is queued to
 *   in_queue when DMA completes, buffer is retrieved from in_queue
 *   and queued to out_queue when application reads, buffer is read
 *   (may optionally block) from out_queue and presented to application.
 */
struct stream {
	int32_t state;
	const struct device *dma_dev;
	uint32_t dma_channel;
	struct i2s_config cfg;
	struct dma_config dma_cfg;
	struct dma_block_config blk_cfg[2];
	uint8_t src_addr_increment;
	uint8_t dst_addr_increment;
	bool last_block;
	struct k_msgq in_queue;
	struct k_msgq out_queue;
	uint8_t *ping_pong_buf[2];
	uint8_t ping_pong_index;
};

struct i2s_rtl8752h_config {
	I2S_TypeDef *base;
	uint32_t clkid;
	const struct pinctrl_dev_config *pinctrl;
	void (*irq_config_func)(const struct device *dev);
};

/* Device run time data */
struct i2s_rtl8752h_data {
#if defined(CONFIG_I2S_RTL8752H_TX)
	struct stream dma_tx;
	void *tx_in_msgs[CONFIG_I2S_RTL8752H_TX_BLOCK_COUNT];
	void *tx_out_msgs[CONFIG_I2S_RTL8752H_TX_BLOCK_COUNT];
#endif
#if defined(CONFIG_I2S_RTL8752H_RX)
	struct stream dma_rx;
	void *rx_in_msgs[CONFIG_I2S_RTL8752H_RX_BLOCK_COUNT];
	void *rx_out_msgs[CONFIG_I2S_RTL8752H_RX_BLOCK_COUNT];
#endif
};

#if defined(CONFIG_I2S_RTL8752H_TX)
static void i2s_rtl8752h_dma_tx_cb(const struct device *, void *, uint32_t, int);
static void i2s_tx_stream_disable(const struct device *, bool drop);
#endif
#if defined(CONFIG_I2S_RTL8752H_RX)
static void i2s_rtl8752h_dma_rx_cb(const struct device *, void *, uint32_t, int);
static void i2s_rx_stream_disable(const struct device *, bool in_drop, bool out_drop);
#endif

static inline void i2s_purge_stream_buffers(struct stream *strm, struct k_mem_slab *mem_slab,
					    bool in_drop, bool out_drop)
{
	void *buffer;

	if (in_drop) {
		while (k_msgq_get(&strm->in_queue, &buffer, K_NO_WAIT) == 0) {
			k_mem_slab_free(mem_slab, buffer);
		}
	}

	if (out_drop) {
		while (k_msgq_get(&strm->out_queue, &buffer, K_NO_WAIT) == 0) {
			k_mem_slab_free(mem_slab, buffer);
		}
	}
}
static inline void i2s_set_satus(struct i2s_rtl8752h_data *dev_data, enum i2s_dir dir,
				 enum i2s_state state)
{
	if (dir == I2S_DIR_TX) {
#if defined(CONFIG_I2S_RTL8752H_TX)
		dev_data->dma_tx.state = state;
#endif
	} else {
#if defined(CONFIG_I2S_RTL8752H_RX)
		dev_data->dma_rx.state = state;
#endif
	}
}

#if defined(CONFIG_I2S_RTL8752H_TX)
static void i2s_tx_stream_disable(const struct device *dev, bool drop)
{
	const struct i2s_rtl8752h_config *dev_cfg = dev->config;
	struct i2s_rtl8752h_data *dev_data = dev->data;
	I2S_TypeDef *base = (I2S_TypeDef *)dev_cfg->base;
	struct stream *strm = &dev_data->dma_tx;
	const struct device *dma_dev = strm->dma_dev;

	LOG_DBG("Stopping DMA channel %u for TX stream", strm->dma_channel);

	dma_stop(dma_dev, strm->dma_channel);
	I2S_Cmd(base, I2S_MODE_TX, DISABLE);

	/* purge buffers queued in the stream */
	if (drop) {
		i2s_purge_stream_buffers(strm, dev_data->dma_tx.cfg.mem_slab, true, true);
	}
}

/* This function is executed in the interrupt context */
static void i2s_rtl8752h_dma_tx_cb(const struct device *dma_dev, void *arg, uint32_t channel,
				   int status)
{
	const struct device *dev = (struct device *)arg;
	const struct i2s_rtl8752h_config *dev_cfg = dev->config;
	struct i2s_rtl8752h_data *dev_data = dev->data;
	I2S_TypeDef *base = (I2S_TypeDef *)dev_cfg->base;
	struct stream *strm = &dev_data->dma_tx;
	void *buffer = NULL;
	int ret;
	uint8_t blocks_queued;

	LOG_DBG("tx cb");

	ret = k_msgq_get(&strm->out_queue, &buffer, K_NO_WAIT);
	if (ret == 0) {
		/* transmission complete. free the buffer */
		k_mem_slab_free(strm->cfg.mem_slab, buffer);
	} else {
		LOG_ERR("no buf in out_queue for channel %u", channel);
	}

	/* Received a STOP trigger, terminate TX immediately */
	if (strm->last_block) {
		strm->state = I2S_STATE_READY;
		LOG_DBG("TX STOPPED last_block set");
		goto disabled_exit_no_drop;
	}

	if (ret) {
		/* k_msgq_get() returned error, and was not last_block */
		strm->state = I2S_STATE_ERROR;
		goto disabled_exit_no_drop;
	}

	switch (strm->state) {
	case I2S_STATE_RUNNING:
	case I2S_STATE_STOPPING:
		ret = k_msgq_get(&strm->in_queue, &buffer, K_NO_WAIT);
		if (ret) {
			if (strm->state == I2S_STATE_STOPPING) {
				/* TX queue has drained */
				strm->state = I2S_STATE_READY;
				goto disabled_exit_drop;
				LOG_DBG("TX stream has stopped");
			} else {
				strm->state = I2S_STATE_ERROR;
				goto disabled_exit_no_drop;
				LOG_DBG("TX stream no data");
			}
		}

		if (strm->ping_pong_index == 0) {
			memcpy(strm->ping_pong_buf[0], buffer, strm->cfg.block_size);
			strm->ping_pong_index = 1;
		} else {
			memcpy(strm->ping_pong_buf[1], buffer, strm->cfg.block_size);
			strm->ping_pong_index = 0;
		}

