rtkconnectivity/zephyr/drivers/i2s/i2s_rtl8752h.c
	switch (strm->state) {
	case I2S_STATE_RUNNING:
	case I2S_STATE_STOPPING:
		/* retrieve buffer from input queue */
		ret = k_msgq_get(&strm->in_queue, &buffer, K_NO_WAIT);
		__ASSERT_NO_MSG(ret == 0);

		if (strm->ping_pong_index == 0) {
			memcpy(buffer, strm->ping_pong_buf[0], strm->cfg.block_size);
			strm->ping_pong_index = 1;
		} else {
			memcpy(buffer, strm->ping_pong_buf[1], strm->cfg.block_size);
			strm->ping_pong_index = 0;
		}

		/* put buffer to output queue */
		ret = k_msgq_put(&strm->out_queue, &buffer, K_NO_WAIT);

		if (ret != 0) {
			LOG_ERR("buffer %p -> out_queue %p err %d", buffer, &strm->out_queue, ret);
			i2s_rx_stream_disable(dev, false, false);
			strm->state = I2S_STATE_ERROR;
			return;
		}
		if (strm->state == I2S_STATE_RUNNING) {
			/* allocate new buffer for next audio frame */
			ret = k_mem_slab_alloc(strm->cfg.mem_slab, &buffer, K_NO_WAIT);
			if (ret != 0) {
				LOG_ERR("buffer alloc from slab %p err %d", strm->cfg.mem_slab,
					ret);
				i2s_rx_stream_disable(dev, false, false);
				strm->state = I2S_STATE_ERROR;
			} else {
				/* put buffer in input queue */
				ret = k_msgq_put(&strm->in_queue, &buffer, K_NO_WAIT);
				if (ret != 0) {
					LOG_ERR("%p -> in_queue %p err %d", buffer, &strm->in_queue,
						ret);
				}
			}
		} else {
			i2s_rx_stream_disable(dev, true, false);
			/* Received a STOP/DRAIN trigger */
			strm->state = I2S_STATE_READY;
		}
		break;
	case I2S_STATE_ERROR:
		i2s_rx_stream_disable(dev, true, true);
		break;
	}
}
#endif

static int i2s_rtl8752h_configure(const struct device *dev, enum i2s_dir dir,
				  const struct i2s_config *i2s_cfg)
{
	const struct i2s_rtl8752h_config *dev_cfg = dev->config;
	struct i2s_rtl8752h_data *dev_data = dev->data;
	I2S_TypeDef *base = (I2S_TypeDef *)dev_cfg->base;

	I2S_InitTypeDef I2S_InitStruct;

	if (dir == I2S_DIR_TX) {
#if defined(CONFIG_I2S_RTL8752H_TX)
		if ((dev_data->dma_tx.state != I2S_STATE_NOT_READY) &&
		    (dev_data->dma_tx.state != I2S_STATE_READY)) {
			LOG_ERR("invalid state tx(%u)", dev_data->dma_tx.state);
			return -EINVAL;
		}
		dev_data->dma_tx.state = I2S_STATE_NOT_READY;
#else
		return -EINVAL;
#endif
	} else if (dir == I2S_DIR_RX) {
#if defined(CONFIG_I2S_RTL8752H_RX)
		if ((dev_data->dma_rx.state != I2S_STATE_NOT_READY) &&
		    (dev_data->dma_rx.state != I2S_STATE_READY)) {
			LOG_ERR("invalid state rx(%u)", dev_data->dma_rx.state);
			return -EINVAL;
		}
		dev_data->dma_rx.state = I2S_STATE_NOT_READY;
#else
		return -EINVAL;
#endif
	}

	if (i2s_cfg->frame_clk_freq == 8000) {
		I2S_InitStruct.I2S_BClockMi = 0x186A;
		I2S_InitStruct.I2S_BClockNi = 0x50;
	} else if (i2s_cfg->frame_clk_freq == 16000) {
		I2S_InitStruct.I2S_BClockMi = 0x186A;
		I2S_InitStruct.I2S_BClockNi = 0xA0;
	} else if (i2s_cfg->frame_clk_freq == 0) {
		(void)clock_control_off(RTL8752H_CLOCK_CONTROLLER,
					(clock_control_subsys_t)&dev_cfg->clkid);

		i2s_set_satus(dev_data, dir, I2S_STATE_NOT_READY);
	} else {
		LOG_ERR("invalid i2s sample rate: %d", i2s_cfg->frame_clk_freq);
		i2s_set_satus(dev_data, dir, I2S_STATE_NOT_READY);
		return -EINVAL;
	}

	if (i2s_cfg->word_size == 8) {
		I2S_InitStruct.I2S_DataWidth = I2S_Width_8Bits;
	} else if (i2s_cfg->word_size == 16) {
		I2S_InitStruct.I2S_DataWidth = I2S_Width_16Bits;
	} else if (i2s_cfg->word_size == 24) {
		I2S_InitStruct.I2S_DataWidth = I2S_Width_24Bits;
	} else {
		LOG_ERR("invalid i2s word size: %d", i2s_cfg->word_size);
		i2s_set_satus(dev_data, dir, I2S_STATE_NOT_READY);
		return -EINVAL;
	}

	if (i2s_cfg->channels == 1) {
		I2S_InitStruct.I2S_ChannelType = I2S_Channel_Mono;
	} else if (i2s_cfg->channels == 2) {
		I2S_InitStruct.I2S_ChannelType = I2S_Channel_stereo;
	} else {
		LOG_ERR("invalid i2s channels: %d", i2s_cfg->channels);
		i2s_set_satus(dev_data, dir, I2S_STATE_NOT_READY);
		return -EINVAL;
	}

	if ((i2s_cfg->format & I2S_FMT_DATA_FORMAT_MASK) == I2S_FMT_DATA_FORMAT_I2S) {
		I2S_InitStruct.I2S_DataFormat = I2S_Mode;
	} else if ((i2s_cfg->format & I2S_FMT_DATA_FORMAT_MASK) == I2S_FMT_DATA_FORMAT_PCM_SHORT) {
		I2S_InitStruct.I2S_DataFormat = PCM_Mode_A;
	} else if ((i2s_cfg->format & I2S_FMT_DATA_FORMAT_MASK) == I2S_FMT_DATA_FORMAT_PCM_LONG) {
		I2S_InitStruct.I2S_DataFormat = PCM_Mode_B;
	} else if ((i2s_cfg->format & I2S_FMT_DATA_FORMAT_MASK) ==
		   I2S_FMT_DATA_FORMAT_LEFT_JUSTIFIED) {
		I2S_InitStruct.I2S_DataFormat = Left_Justified_Mode;
	} else {
		LOG_ERR("invalid i2s format: 0x%x", i2s_cfg->format);
		i2s_set_satus(dev_data, dir, I2S_STATE_NOT_READY);
		return -EINVAL;
	}

	if ((i2s_cfg->format & I2S_FMT_DATA_ORDER_LSB) == I2S_FMT_DATA_ORDER_LSB) {
		I2S_InitStruct.I2S_TxBitSequence = I2S_TX_LSB_First;
		I2S_InitStruct.I2S_RxBitSequence = I2S_RX_LSB_First;
	} else {
		I2S_InitStruct.I2S_TxBitSequence = I2S_TX_MSB_First;
		I2S_InitStruct.I2S_RxBitSequence = I2S_RX_MSB_First;
	}

	if ((i2s_cfg->options & I2S_OPT_BIT_CLK_SLAVE) == I2S_OPT_BIT_CLK_SLAVE) {
		I2S_InitStruct.I2S_DeviceMode = I2S_DeviceMode_Slave;
	} else {
		I2S_InitStruct.I2S_DeviceMode = I2S_DeviceMode_Master;
	}

	if ((i2s_cfg->options & I2S_OPT_BIT_CLK_GATED) == I2S_OPT_BIT_CLK_GATED) {
		return -EINVAL;
	}

	if ((i2s_cfg->options & I2S_OPT_LOOPBACK) == I2S_OPT_LOOPBACK) {
		return -EINVAL;
	}

	I2S_InitStruct.I2S_ClockSource = I2S_CLK_40M;
	I2S_InitStruct.I2S_TxChSequence = I2S_TX_CH_L_R;
	I2S_InitStruct.I2S_RxChSequence = I2S_RX_CH_L_R;
	I2S_InitStruct.I2S_MCLKOutput = I2S_MCLK_128fs;
	I2S_InitStruct.I2S_DMACmd = I2S_DMA_ENABLE;
#if defined(CONFIG_I2S_RTL8752H_RX)
	I2S_InitStruct.I2S_TxWaterlevel = 64 - dev_data->dma_tx.dma_cfg.dest_burst_length;
#endif
#if defined(CONFIG_I2S_RTL8752H_RX)
	I2S_InitStruct.I2S_RxWaterlevel = dev_data->dma_rx.dma_cfg.source_burst_length;
#endif

	/* clock */
	(void)clock_control_on(RTL8752H_CLOCK_CONTROLLER, (clock_control_subsys_t)&dev_cfg->clkid);

	/* pinctrl */
	pinctrl_apply_state(dev_cfg->pinctrl, PINCTRL_STATE_DEFAULT);

	I2S_Init(base, &I2S_InitStruct);

	if (dir == I2S_DIR_TX) {
#if defined(CONFIG_I2S_RTL8752H_TX)
		memcpy(&dev_data->dma_tx.cfg, i2s_cfg, sizeof(struct i2s_config));
#endif
	} else {
#if defined(CONFIG_I2S_RTL8752H_RX)
		memcpy(&dev_data->dma_rx.cfg, i2s_cfg, sizeof(struct i2s_config));
#endif
	}

