rtkconnectivity/zephyr/drivers/i2s/i2s_rtl8752h.c
	i2s_set_satus(dev_data, dir, I2S_STATE_READY);

	return 0;
}

const struct i2s_config *i2s_rtl8752h_config_get(const struct device *dev, enum i2s_dir dir)
{
	struct i2s_rtl8752h_data *dev_data = dev->data;

#if defined(CONFIG_I2S_RTL8752H_TX)
	if (dir == I2S_DIR_TX) {
		return &dev_data->dma_tx.cfg;
	}
#endif

#if defined(CONFIG_I2S_RTL8752H_RX)
	if (dir == I2S_DIR_RX) {
		return &dev_data->dma_rx.cfg;
	}
#endif

	return NULL;
}

static int i2s_rtl8752h_trigger(const struct device *dev, enum i2s_dir dir,
				enum i2s_trigger_cmd cmd)
{
	const struct i2s_rtl8752h_config *dev_cfg = dev->config;
	struct i2s_rtl8752h_data *dev_data = dev->data;
	I2S_TypeDef *base = (I2S_TypeDef *)dev_cfg->base;
	struct stream *strm;
	unsigned int key;
	int ret = 0;

	strm = NULL;

#if defined(CONFIG_I2S_RTL8752H_TX)
	if (dir == I2S_DIR_TX) {
		strm = &dev_data->dma_tx;
	}
#endif

#if defined(CONFIG_I2S_RTL8752H_RX)
	if (dir == I2S_DIR_RX) {
		strm = &dev_data->dma_rx;
	}
#endif

	if (strm == NULL) {
		return -ENOSYS;
	}

	key = irq_lock();
	switch (cmd) {
	case I2S_TRIGGER_START:
		if (strm->state != I2S_STATE_READY) {
			LOG_ERR("START trigger: invalid state %u", strm->state);
			ret = -EIO;
			break;
		}

		if (dir == I2S_DIR_TX) {
#if defined(CONFIG_I2S_RTL8752H_TX)
			ret = i2s_tx_stream_start(dev);
#endif
		} else {
#if defined(CONFIG_I2S_RTL8752H_RX)
			ret = i2s_rx_stream_start(dev);
#endif
		}

		if (ret < 0) {
			LOG_DBG("START trigger failed %d", ret);
			ret = -EIO;
			break;
		}

		strm->state = I2S_STATE_RUNNING;
		strm->last_block = false;
		break;

	case I2S_TRIGGER_STOP:
		if (strm->state != I2S_STATE_RUNNING) {
			LOG_ERR("STOP trigger: invalid state %d", strm->state);
			ret = -EIO;
			break;
		}

		strm->state = I2S_STATE_STOPPING;
		strm->last_block = true;
		break;

	case I2S_TRIGGER_DRAIN:
		if (strm->state != I2S_STATE_RUNNING) {
			LOG_ERR("DRAIN/STOP trigger: invalid state %d", strm->state);
			ret = -EIO;
			break;
		}

		strm->state = I2S_STATE_STOPPING;
		break;

	case I2S_TRIGGER_DROP:
		if (strm->state == I2S_STATE_NOT_READY) {
			LOG_ERR("DROP trigger: invalid state %d", strm->state);
			ret = -EIO;
			break;
		}

		strm->state = I2S_STATE_READY;
		if (dir == I2S_DIR_TX) {
#if defined(CONFIG_I2S_RTL8752H_TX)
			i2s_tx_stream_disable(dev, true);
#endif
		} else {
#if defined(CONFIG_I2S_RTL8752H_RX)
			i2s_rx_stream_disable(dev, true, true);
#endif
		}
		break;

	case I2S_TRIGGER_PREPARE:
		if (strm->state != I2S_STATE_ERROR) {
			LOG_ERR("PREPARE trigger: invalid state %d", strm->state);
			ret = -EIO;
			break;
		}
		strm->state = I2S_STATE_READY;
		if (dir == I2S_DIR_TX) {
#if defined(CONFIG_I2S_RTL8752H_TX)
			i2s_tx_stream_disable(dev, true);
#endif
		} else {
#if defined(CONFIG_I2S_RTL8752H_RX)
			i2s_rx_stream_disable(dev, true, true);
#endif
		}
		break;

	default:
		LOG_ERR("Unsupported trigger command");
		ret = -EINVAL;
	}

	irq_unlock(key);

	return ret;
}

static void i2s_rtl8752h_isr(const struct device *dev)
{
	const struct i2s_rtl8752h_config *dev_cfg = dev->config;
	struct i2s_rtl8752h_data *dev_data = dev->data;
	I2S_TypeDef *base = (I2S_TypeDef *)dev_cfg->base;
}

static int i2s_rtl8752h_init(const struct device *dev)
{
	const struct i2s_rtl8752h_config *dev_cfg = dev->config;
	struct i2s_rtl8752h_data *dev_data = dev->data;
	I2S_TypeDef *base = (I2S_TypeDef *)dev_cfg->base;

#if defined(CONFIG_I2S_RTL8752H_TX)
	if (!dev_data->dma_tx.dma_dev) {
		LOG_ERR("DMA device not found");
		return -ENODEV;
	}
#endif

#if defined(CONFIG_I2S_RTL8752H_RX)
	if (!dev_data->dma_rx.dma_dev) {
		LOG_ERR("DMA device not found");
		return -ENODEV;
	}
#endif

	/* Initialize the buffer queues */
#if defined(CONFIG_I2S_RTL8752H_TX)
	k_msgq_init(&dev_data->dma_tx.in_queue, (char *)dev_data->tx_in_msgs, sizeof(void *),
		    CONFIG_I2S_RTL8752H_TX_BLOCK_COUNT);
	k_msgq_init(&dev_data->dma_tx.out_queue, (char *)dev_data->tx_out_msgs, sizeof(void *),
		    CONFIG_I2S_RTL8752H_TX_BLOCK_COUNT);
	/* Configure dma tx config */
	memset(&(dev_data->dma_tx.blk_cfg[0]), 0, sizeof(dev_data->dma_tx.blk_cfg[0]));
	memset(&(dev_data->dma_tx.blk_cfg[1]), 0, sizeof(dev_data->dma_tx.blk_cfg[1]));
	dev_data->dma_tx.blk_cfg[0].dest_address = (uint32_t)(&(base->TX_DR));
	dev_data->dma_tx.blk_cfg[0].source_address = 0; /* not ready */
	dev_data->dma_tx.blk_cfg[0].source_addr_adj = dev_data->dma_tx.src_addr_increment;
	dev_data->dma_tx.blk_cfg[0].dest_addr_adj = dev_data->dma_tx.dst_addr_increment;
	dev_data->dma_tx.blk_cfg[0].next_block = &(dev_data->dma_tx.blk_cfg[1]);
	dev_data->dma_tx.blk_cfg[1].dest_address = (uint32_t)(&(base->TX_DR));
	dev_data->dma_tx.blk_cfg[1].source_address = 0; /* not ready */
	dev_data->dma_tx.blk_cfg[1].source_addr_adj = dev_data->dma_tx.src_addr_increment;
	dev_data->dma_tx.blk_cfg[1].dest_addr_adj = dev_data->dma_tx.dst_addr_increment;
	dev_data->dma_tx.blk_cfg[1].next_block = NULL;
	dev_data->dma_tx.dma_cfg.head_block = &dev_data->dma_tx.blk_cfg[0];
	dev_data->dma_tx.dma_cfg.user_data = (void *)dev;

	dev_data->dma_tx.state = I2S_STATE_NOT_READY;
#endif
#if defined(CONFIG_I2S_RTL8752H_RX)
	k_msgq_init(&dev_data->dma_rx.in_queue, (char *)dev_data->rx_in_msgs, sizeof(void *),
		    CONFIG_I2S_RTL8752H_RX_BLOCK_COUNT);
	k_msgq_init(&dev_data->dma_rx.out_queue, (char *)dev_data->rx_out_msgs, sizeof(void *),
		    CONFIG_I2S_RTL8752H_RX_BLOCK_COUNT);
	/* Configure dma rx config */
	memset(&(dev_data->dma_rx.blk_cfg[0]), 0, sizeof(dev_data->dma_rx.blk_cfg[0]));
	memset(&(dev_data->dma_rx.blk_cfg[1]), 0, sizeof(dev_data->dma_rx.blk_cfg[1]));
	dev_data->dma_rx.blk_cfg[0].source_address = (uint32_t)(&(base->RX_DR));
	dev_data->dma_rx.blk_cfg[0].dest_address = 0; /* dest not ready */
	dev_data->dma_rx.blk_cfg[0].source_addr_adj = dev_data->dma_rx.src_addr_increment;
	dev_data->dma_rx.blk_cfg[0].dest_addr_adj = dev_data->dma_rx.dst_addr_increment;
	dev_data->dma_rx.blk_cfg[0].next_block = &(dev_data->dma_rx.blk_cfg[1]);
	dev_data->dma_rx.blk_cfg[1].source_address = (uint32_t)(&(base->RX_DR));
	dev_data->dma_rx.blk_cfg[1].dest_address = 0; /* dest not ready */
	dev_data->dma_rx.blk_cfg[1].source_addr_adj = dev_data->dma_rx.src_addr_increment;
	dev_data->dma_rx.blk_cfg[1].dest_addr_adj = dev_data->dma_rx.dst_addr_increment;
	dev_data->dma_rx.blk_cfg[1].next_block = NULL;
	dev_data->dma_rx.dma_cfg.head_block = &dev_data->dma_rx.blk_cfg[0];
	dev_data->dma_rx.dma_cfg.user_data = (void *)dev;

	dev_data->dma_rx.state = I2S_STATE_NOT_READY;
#endif

